---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarLayoutRule.FixedNumber
enum: Autodesk.Revit.DB.Structure.RebarLayoutRule
source: html/bc9034d0-5055-c55e-2686-b221d156ed48.htm
---
# Autodesk.Revit.DB.Structure.RebarLayoutRule.FixedNumber

The spacing between the rebar is adjustable,
 but the number of bars is constant based on input.